tap 'businesscritical/tap'
tap 'derailed/k9s'
tap 'homebrew/cask-fonts'
tap 'neovim/neovim'
tap 'universal-ctags/universal-ctags'
tap 'buildpacks/tap'

brew 'ack'
brew 'adr-tools'
brew 'aria2'
brew 'autojump'
brew 'awscli'
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'bbr'
brew 'buildpacks/tap/pack'
brew 'cf-cli'
brew 'cf7-cli'
brew 'chruby'
brew 'cloudfoundry/tap/bbl'
brew 'cloudfoundry/tap/bosh-cli'
brew 'cloudfoundry/tap/credhub-cli'
brew 'coreutils'
brew 'derailed/k9s/k9s'
brew 'dishy'
brew 'fasd'
brew 'fd'
brew 'git-author'
brew 'git-secrets'
brew 'git-together'
brew 'helm'
brew 'httpie'
brew 'ipcalc'
brew 'jq'
brew 'minikube'
brew 'neovim'
brew 'proxychains-ng'
brew 'pstree'
brew 'python', link: true, overwrite: true
brew 'python-yq', link: true, overwrite: true
brew 'qt'
brew 'ripgrep'
brew 's3cmd'
brew 'ssh-copy-id'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD']
brew 'watch'

cask 'tuple'
cask 'flycut'
cask 'homebrew/cask-fonts/font-hack-nerd-font'
cask 'goland'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'rubymine'
cask 'sequel-pro'
cask 'spectacle'
cask 'visual-studio-code'
# slack cask intentionally removed for bad behavior - hijacking slack links, memory bloat.

cask 'zoomus'
