tap 'businesscritical/tap'
tap 'cloudfoundry/tap'
tap 'neovim/neovim'
tap 'pivotal/tap'
tap 'universal-ctags/universal-ctags'

brew 'ack'
brew 'adr-tools'
brew 'aria2'
brew 'autojump'
brew 'awscli'
brew 'bash-completion'
brew 'bat'
brew 'bbr'
brew 'cf-cli'
brew 'chruby'
brew 'cloudfoundry/tap/bbl'
brew 'cloudfoundry/tap/bosh-cli'
brew 'cloudfoundry/tap/credhub-cli'
brew 'coreutils'
brew 'direnv'
brew 'dishy'
brew 'docker'
brew 'fasd'
brew 'git'
brew 'git-author'
brew 'git-secrets'
brew 'git-together'
brew 'go'
brew 'httpie'
brew 'jq'
brew 'lastpass-cli'
brew 'mysql'
brew 'neovim'
brew 'node'
brew 'postgresql@9.6', restart_service: true, link: true
brew 'proxychains-ng'
brew 'pstree'
brew 'python'
brew 'python-yq'
brew 'qt'
brew 'ruby-install'
brew 's3cmd'
brew 'shellcheck'
brew 'ssh-copy-id'
brew 'the_platinum_searcher'
brew 'the_silver_searcher'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD']
brew 'watch'
brew 'wget'
brew 'yarn'

cask 'docker'
cask 'flycut'
cask 'font-hack-nerd-font'
cask 'goland'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'rubymine'
cask 'ryanmoran/tools/radar'
cask 'sequel-pro'
cask 'spectacle'
cask 'visual-studio-code'
cask 'zoomus'
# slack cask intentionally removed for bad behavior - hijacking slack links, memory bloat.
