tap 'cloudfoundry/tap'
tap 'k14s/tap'
tap 'pivotal/tap'
tap 'buildpacks/tap'

# Core utilities
brew 'git'
brew 'lastpass-cli'
brew 'wget'
brew 'coreutils'
brew 'direnv'

# Core services
brew 'docker', overwrite: true, link: true
brew 'mysql'
brew 'postgresql@9.6', restart_service: true, link: true

# Kubernetes binaries
brew 'kubernetes-cli'

# CloudFoundry binaries
brew 'bbr'
brew 'cloudfoundry/tap/cf-cli@7', link: true, overwrite: true
brew 'cloudfoundry/tap/cf-cli@6'
brew 'cloudfoundry/tap/bbl'
brew 'cloudfoundry/tap/bosh-cli'
brew 'cloudfoundry/tap/credhub-cli'
brew 'ytt'
brew 'vendir'
brew 'kapp'
brew 'kbld'
brew 'buildpacks/tap/pack'

# Language support
brew 'go'
brew 'ruby-install'
brew 'chruby'
brew 'node'
brew 'python', link: true, overwrite: true
brew 'shellcheck'
brew 'yarn'
cask 'java'

cask 'docker'
