tap 'businesscritical/tap'
tap 'cloudfoundry/tap'
tap 'git-duet/tap'
tap 'universal-ctags/universal-ctags'
tap 'neovim/neovim'

brew 'ack'
brew 'aria2'
brew 'awscli'
brew 'bash-completion'
brew 'cf-cli'
brew 'chruby'
brew 'cloudfoundry/tap/bosh-cli'
brew 'cloudfoundry/tap/credhub-cli'
brew 'coreutils'
brew 'direnv'
brew 'dishy'
brew 'fasd'
brew 'git-duet'
brew 'git-secrets'
brew 'go'
brew 'jq'
brew 'mysql'
brew 'neovim'
brew 'node'
brew "postgresql@9.6", restart_service: true, link: true
brew 'proxychains-ng'
brew 'pstree'
brew 'python3'
brew 'qt'
brew 'ruby-install'
brew 's3cmd'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'the_platinum_searcher'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD']
brew 'watch'
brew 'wget'

cask 'flycut'
cask 'google-chrome'
cask 'iterm2'
cask 'rubymine'
cask 'slack'
cask 'spectacle'
