tap 'cloudfoundry/tap'
tap 'k14s/tap'
tap 'pivotal/tap'
tap 'buildpacks/tap'

# Core utilities
brew 'git'
brew 'wget'
brew 'coreutils'
brew 'direnv'

# Core services
brew 'docker', overwrite: true, link: true

# Kubernetes binaries
brew 'kubernetes-cli'

# CloudFoundry binaries
brew 'bbr'
brew 'cloudfoundry/tap/bbl'
brew 'cloudfoundry/tap/bosh-cli'
brew 'cloudfoundry/tap/credhub-cli'
brew 'ytt'
brew 'vendir'
brew 'kapp'
brew 'kbld'
brew 'buildpacks/tap/pack'

# Fun CLI gizmos
brew 'gti'

# Language support
brew 'go'
brew 'python', link: true, overwrite: true
brew 'shellcheck'
brew 'java'

cask 'docker'
